## Redis数据结构简介

Ｒedis不仅仅用来存储k/v键值对，它实际上可一用来作为一个数据结构服务，redis支持多种类型的值
这也就意味着，在redis中存储的值的类型，不再局限于字符串类型，还可一存储更为复杂的数据类型，比如：
- 二进制安全的字符串类型
- 列表(Lists)，按照写入顺序排列的字符串元素的集合，这是基础的链表列表
- 集合(Sets),唯一，无序字符串元素的集合
- 可排序集合(Sorted sets), 与集合类似，但是每一个元素值都与一个称为分数(score)的浮点型数字相关联，
  在该集合里面的元素，每一次的获取，都依据其分数进行排序,不同于集合，可排序集合是可以检索元素的
- 哈希(Hashes), 哈希是字段与其所对应的值的映射，其字段和值都是字符串类型
- 比特数组(Bit arrays),用于特别的命令行来处理一个字符串的值，就像处理一个元素是比特类型的数组
- HyperLogLogs: 用于估计一个 set 中元素数量的概率性的数据结构

## Redis Key
Redis的key是二进制安全的，这也就意味着你可以使用任何二进制形式的key,从字符串到图片文件的内容，
当然，空字符串也是可以的字符串的规则如下：
- 过长的key并不是一个好的选择，过长的key不仅仅占用内存，而且在Ｓet数据类型中需要进行key的比较
- 过短的key不利于阅读
- 善于使用分隔符号，比如`object-type:id`的形式
- Ｒedis所允许的key的最大值为512M

## Redis String
字符串类型在Ｒedis中是最简单的一种数据类型，也是memcached中唯一的数据类型，
当我们使用字符串作为key的时候，也就把key和字符串类型的值关联了起来，这时一种非常有用的数据结构，
比如用于存储html碎片或者文章，下面进行一个简单的操作：
```redis
> set myKey someValue
ok
> get mykey
"somevalue"
```
如上所示，我们可以通过`set` 和`get`两个命令来设置和获取值，需要注意的是，`set`命令会替换原先存在的key
所代表的值,当然也可以通过设置第三个参数(nx,xx)来表明如何处理已经存在key的情况
```redis
set mykey hello nx
set mykey world xx
```
当使用nx的时候，如果存在，则不替换，而xx则标识强制替换

对于字符串的数据类型来说，可以使用`incr`命令设置其自动增长,使用`incrby`设置其增长幅度
```redis
> set counter 100
ok
> incr counter
(integer) 101
> incr counter 
(integer) 102
> incrby counter 10
```
对于incr命令来说，将值为字符串类型解析成整型，使其按照`+1`的方式增长，最后再将值设置成最后的结果。
作用类似的函数有：`INCRBY, DECR,DECRBY`

`INCR`命令的自动增长意味着，假设有两个客户端同时设置一个key为由10,增长为11,那么当你最后去读取该key
的值的时候，其最终结果永远是12，而不是11,这时因为这个写入是锁定的

当然，对于操作字符串还有很多的命令，比如`GETSET`，该命令在设置一个新值的时候，会返回旧的值。
假设我们有一个网站，每一次有请求的时候，都会使用`INCR`命令设置浏览量自动增加，我们相隔一个小时就
进行一次统计，那么我们就可以使用`GETSET`命令，设置新的值为0,并返回统计值

对于在一条命令里面同时设置多个值是非常有效的
```redis
> mset a 10 b 20 c 30
ok
> mget a b c
1) "10"
2) "20"
3) "30"
```
通过使用`MGET, MSET`命令，可以以此设置和获取多个值，对于`MGET`命令，返回的是一个数组

